#include <iostream> 
using namespace std;

int main() 
{
    int num, d1, d2, d3, d4, s1, s2;
    cout << "Введите четырехзначное число = ";
    cin >> num;

    // поиск разрядов четырехзначного числа 
    d1 = num / 1000;
    d2 = num / 100 % 10;
    d3 = num / 10 % 10;
    d4 = num % 10;

    // вывод разрядов четырехзначного числа 
    cout << d1 << "\n";
    cout << d2 << "\n";
    cout << d3 << "\n";
    cout << d4 << "\n";

    // вычисление сумм 
    s1 = d1 + d4;
    s2 = d2 + d3;

    cout << "Сумма первого и последнего разрядов = " << s1 << "\n";
    cout << "Сумма второго и предпоследнего разрядов = " << s2 << "\n";
}
